[FreeKillUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Repeater"
FriendlyNamePlural="Repeaters"
BriefSummary="Increase critical damage by <Ability:REPEATERDMGBONUSM1/>."
TinySummary="Increase critical damage."
LootTooltip="This weapon upgrade, when installed, adds a small bonus to critical damage."

[FreeKillUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Repeater"
FriendlyNamePlural="Advanced Repeaters"
BriefSummary="Increase critical damage by <Ability:REPEATERDMGBONUSM2/>."
TinySummary="Increase critical damage."
LootTooltip="This weapon upgrade, when installed, adds a medium bonus to critical damage."

[FreeKillUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Repeater"
FriendlyNamePlural="Superior Repeaters"
BriefSummary="Increase critical damage by <Ability:REPEATERDMGBONUSM3/>."
TinySummary="Increase critical damage."
LootTooltip="This weapon upgrade, when installed, adds a sizeable bonus to critical damage."
